local addon, ns = ...
local C, F, G, T = unpack(ns)

-- 抄他喵的
-- https://github.com/siweia/NDui/blob/master/Interface/AddOns/NDui/Config/Nameplate.lua

--======================================================--
-----------------    [[ Nameplates ]]    -----------------
--======================================================--
--[[
C.StackList = {

	}
]]--
C.WhiteList = {
	-- [[ 補足暴雪的白名單裡缺少的控場法術 ]] --
	
	-- Buffs
	--[1459] = true,	-- 秘法智力test
	[642]	 = true,	-- 聖盾術
	[1022]	 = true,	-- 保護祝福
	[23920]	 = true,	-- 法術反射
	[45438]	 = true,	-- 寒冰屏障
	[186265] = true,	-- 灵龟守护
	-- Debuffs
	[2094]	 = true,	-- 致盲
	[10326]	 = true,	-- 超度邪恶
	[117405] = true,	-- 束缚射击
	[127797] = true,	-- 厄索爾之旋
	[20549]  = true,	-- 戰爭踐踏
	[107079] = true,	-- 震山掌
	[272295] = true,	-- 悬赏
	
	-- [[ 副本 ]] --
	
	-- 詞綴
	[228318] = true,	-- 狂怒
	[226510] = true,	-- 膿血
	[343502] = true,	-- 鼓舞
	--[343553] = true,	-- 盡噬忿恨
	[373724] = true,	-- 鲜血屏障
	[373011] = true,	-- 伪装
	[373785] = true,	-- 大魔王伪装
	
	-- Dungeons
	[320293] = true,	-- 伤逝剧场，融入死亡
	[331510] = true,	-- 伤逝剧场，死亡之愿
	[333241] = true,	-- 伤逝剧场，暴脾气
	[336449] = true,	-- 凋魂之殇，玛卓克萨斯之墓
	[336451] = true,	-- 凋魂之殇，玛卓克萨斯之壁
	[333737] = true,	-- 凋魂之殇，凝结之疾
	[328175] = true,	-- 凋魂之殇，凝结之疾
	[340357] = true,	-- 凋魂之殇，急速感染
	[228626] = true,	-- 彼界，怨灵之瓮
	[344739] = true,	-- 彼界，幽灵
	[333227] = true,	-- 彼界，不死之怒
	[326771] = true,	-- 贖罪之殿，石之看守者
	[326450] = true,	-- 贖罪之殿，忠實野獸
	[343558] = true,	-- 通灵战潮，病态凝视
	[343470] = true,	-- 通灵战潮，碎骨之盾
	[328351] = true,	-- 通灵战潮，染血长枪
	[322433] = true,	-- 赤红深渊，石肤术
	[321402] = true,	-- 赤红深渊，饱餐
	[327416] = true,	-- 晋升高塔，心能回灌
	[317936] = true,	-- 晋升高塔，弃誓信条
	[327812] = true,	-- 晋升高塔，振奋英气
	[339917] = true,	-- 晋升高塔，命运之矛
	[323149] = true,	-- 仙林，黑暗之拥
	[322569] = true,	-- 仙林，兹洛斯之手
	[355147] = true,	-- 集市，鱼群鼓舞
	[355057] = true,	-- 集市，鱼人战吼
	[351088] = true,	-- 集市，圣物联结
	[355640] = true,	-- 集市，重装方阵
	[355783] = true,	-- 集市，力量增幅
	[347840] = true,	-- 集市，野性
	[347015] = true,	-- 集市，强化防御
	[355934] = true,	-- 集市，强光屏障
	[349933] = true,	-- 集市，狂热鞭笞协议
	[350931] = true,	-- 爬塔软泥免疫
	[164504] = true,	-- 钢铁码头，威吓
	[163689] = true,	-- 钢铁码头，血红之球
	[227548] = true,	-- 卡上，烧蚀护盾
	
	-- Raids
	[334695] = true,	-- 动荡能量，猎手
	[345902] = true,	-- 破裂的联结，猎手
	[346792] = true,	-- 罪触之刃，猩红议会
}

C.BlackList = {
	[15407]	 = true,	-- 精神鞭笞
	[51714]	 = true,	-- 锋锐之霜
	[199721] = true,	-- 腐烂光环
	[214968] = true,	-- 死灵光环
	[214975] = true,	-- 抑心光环
	[273977] = true,	-- 亡者之握
	[276919] = true,	-- 承受压力
	[206930] = true,	-- 心脏打击
}

C.CustomUnits = {
	[120651] = {.7, .95, 1}, 	-- 火爆詞綴，炸藥
	[174773] = {.7, .95, 1}, 	-- 怨毒詞綴，Spiteful Shade
	--[190128] = {.7, .95, 1}, 	-- 隱蔽詞綴，祖尔加玛斯
	
	-- Shadowlands Dungeons	
	[169498] = {.8, 1, .1},		-- 瘟疫之臨，瘟疫彈
	[170851] = {.8, 1, .1},		-- 瘟疫之臨，爆燃瘟疫彈
	[165556] = {.8, 1, .1},		-- 赤红深渊，瞬息具象
	[165251] = {.8, 1, .1},		-- 仙林，幻影仙狐
	[170234] = {.8, 1, .1},		-- 伤逝剧场，压制战旗
	[164464] = {.8, 1, .1},		-- 伤逝剧场，卑劣的席拉
	[171341] = {.8, 1, .1},		-- 彼界，幼鹤
	[175576] = {.8, 1, .1},		-- 集市，监禁
	[179733] = {.8, 1, .1},		-- 集市，鱼串
	[180433] = {.8, 1, .1},		-- 集市，流浪的脉冲星
	[104251] = {.8, 1, .1},		-- 群星庭院，哨兵
	[101008] = {.8, 1, .1},		-- 黑鸦堡垒，针刺虫群
	
	-- Raids
	[175992] = {.8, 1, .1},		-- 猩红议会，忠实的侍从
	[165762] = {.8, 1, .1},		-- 凯子，灵能灌注者
}

C.UnitTarget = {
	[165251] = true,	-- 迷霧的追人狐狸
	[174773] = true,	-- 惡意詞綴，憎恨幽影
}

C.ShowPower = {
	-- NPC IDs
	[133944] = true,	-- 神廟，艾斯匹
	[133379] = true,	-- 神廟，阿德利斯
	[165556] = true,	-- 赤红深渊，瞬息具象
	[171557] = true,	-- 猎手阿尔迪莫，巴加斯特之影
	[165556] = true,	-- 赤红深渊，瞬息具象
	[163746] = true,	-- 垃圾场，步行震击者X1型
	[114247] = true,	-- 卡上，馆长
}

--======================================================--
-----------------    [[ UnitFrames ]]    -----------------
--======================================================--

C.PlayerWhiteList = {
	[315496] = true,
}

C.PlayerBlackList = {
	[2479]	 = true,	-- 無榮譽目標
	[269279] = true,	-- 迴響防護
	[273298] = true,	-- 翔陽寸勁
}

--======================================================--
-----------------    [[ RaidFrames ]]    -----------------
--======================================================--

C.RaidBlackList = {
	[57723]	 = true,		-- 嗜血
	[57724]	 = true,
	[80354]	 = true,
	[264689] = true,
	[206151] = true,		-- 挑戰者的重擔
	
	[271544] = true,		-- 消蝕防護
}