local addon, ns = ...
local C, F, G, T = unpack(ns)

-- 抄他喵的
-- https://github.com/siweia/NDui/blob/master/Interface/AddOns/NDui/Config/Nameplate.lua

--======================================================--
-----------------    [[ Nameplates ]]    -----------------
--======================================================--
--[[
C.StackList = {

	}
]]--
C.WhiteList = {
	-- [[ 補足暴雪的白名單裡缺少的控場法術 ]] --
	
	-- Buffs
	--[1459]		= true,		-- 秘法智力test
	[642]		= true,		-- 聖盾術
	[1022]		= true,		-- 保護祝福
	[23920]		= true,		-- 法術反射
	[45438]		= true,		-- 寒冰屏障
	[186265]	= true,		-- 灵龟守护
	-- Debuffs
	[2094]		= true,		-- 致盲
	[117405]	= true,		-- 束缚射击
	[127797]	= true,		-- 厄索爾之旋
	[20549] 	= true,		-- 戰爭踐踏
	[107079] 	= true,		-- 震山掌
	[272295] 	= true,		-- 悬赏
	
	-- [[ 副本 ]] --
	
	-- 詞綴
	[228318]	= true,		-- 狂怒
	[226510]	= true,		-- 膿血
	[343502]	= true,		-- 鼓舞
	
	-- Dungeons
	[320293]	= true,		-- 伤逝剧场，融入死亡
	[336449]	= true,		-- 凋魂之殇，玛卓克萨斯之墓
	[333737]	= true,		-- 凋魂之殇，凝结之疾
	[328175]	= true,		-- 凋魂之殇，凝结之疾
	[228626]	= true,		-- 彼界，怨灵之瓮
	[326771]	= true,		-- 贖罪之殿，石之看守者
	[326450]	= true,		-- 贖罪之殿，忠實野獸
	
	-- Raids
	[334695]	= true,		-- 动荡能量，猎手
	[345902]	= true,		-- 破裂的联结，猎手
	[346792]	= true,		-- 罪触之刃，猩红议会
}

C.BlackList = {
	[15407]		= true,		-- 精神鞭笞
	[51714]		= true,		-- 锋锐之霜
	[199721]	= true,		-- 腐烂光环
	[214968]	= true,		-- 死灵光环
	[214975]	= true,		-- 抑心光环
	[273977]	= true,		-- 亡者之握
	[276919]	= true,		-- 承受压力
	[206930]	= true,		-- 心脏打击
}

C.CustomUnits = {
	[120651] = {.7, .95, 1},	-- 火爆詞綴，炸藥
	[174773] = {.7, .95, 1},	-- 怨毒詞綴，Spiteful Shade
	
	-- Shadowlands Dungeons	
	[170851] = {.8, 1, .1},		-- 瘟疫之臨，爆燃瘟疫彈
	[165556] = {.8, 1, .1},		-- 赤红深渊，瞬息具象
	[170234] = {.8, 1, .1},		-- 伤逝剧场，压制战旗
	[164464] = {.8, 1, .1},		-- 伤逝剧场，卑劣的席拉
}

C.ShowPower = {
	-- NPC IDs
	[133944] = true,	-- 神廟，艾斯匹
	[133379] = true,	-- 神廟，阿德利斯
	[165556] = true,	-- 赤红深渊，瞬息具象
}

--======================================================--
-----------------    [[ UnitFrames ]]    -----------------
--======================================================--

C.PlayerWhiteList = {
	[315496] = true,
}

C.PlayerBlackList = {
	[2479] = true,		-- 無榮譽目標
	[269279] = true,	-- 迴響防護
	[273298] = true,	-- 翔陽寸勁
}

--======================================================--
-----------------    [[ RaidFrames ]]    -----------------
--======================================================--

C.RaidBlackList = {
	[57723]		= true,		-- 嗜血
	[57724]		= true,
	[80354]		= true,
	[264689]	= true,
	[206151]	= true,		-- 挑戰者的重擔
	
	[271544]	= true,		-- 消蝕防護
}